app/Models/Model_Clientes.php

    public function obtenerClientes()
    {
        return $this->orderBy('apellidos', 'ASC')->findAll();
---
SELECT *
FROM `tbl_clientes`
ORDER BY `apellidos` ASC

    public function obtenerCliente($id_cliente)
    {
        return $this->where('id_cliente', $id_cliente)->first();
---
SELECT *
FROM `tbl_clientes`
WHERE `id_cliente` = '7'
 LIMIT 1

    public function registrarCliente($data)
    {
        return $this->insert($data);
---
INSERT INTO `tbl_clientes` (`nombre`, `apellidos`, `correo`, `telefono1`, `telefono2`, `cliente_frecuente`) VALUES ('abel', 'gamboa', 'abel@a.com', '28937398', '', '1')

    public function actualizarCliente($data)
    {
        return $this->update($data['id_cliente'], $data);
---
UPDATE `tbl_clientes` SET `id_cliente` = '1', `nombre` = 'IVAN', `apellidos` = 'Dominguez', `correo` = 'asd@jsh.com', `telefono1` = '1111111', `telefono2` = '12', `cliente_frecuente` = 0
WHERE `tbl_clientes`.`id_cliente` IN ('1')

    public function obtenerClienteByNombreApellidos($nombre, $apellidos)
    {
        return $this->where('nombre', $nombre)->where('apellidos', $apellidos)->first();
---
SELECT *
FROM `tbl_clientes`
WHERE `nombre` = 'abel'
AND `apellidos` = 'gamboa'
 LIMIT 1